{
  "id": "bear",
  "title": "The Bear",
  "author": "Anton Chekhov",
  "emoji": "🐻",
  "description": "a widow in mourning, a creditor who won't leave, and a duel that goes sideways",
  "image": null,
  "introAnnotation": "Written in 1888, the same year as The Proposal. Two characters, one room, about half an hour of stage time. Chekhov subtitled it 'a joke in one act' and claimed he dashed it off in a single evening. It was an instant hit and kept him financially solvent for some years from royalties alone — which he found embarrassing, given how little he thought of it.",
  "narrator": "en-GB-ThomasNeural",
  "defaultVoice": "en-GB-RyanNeural",
  "dramatis": [
    "Elena Ivanovna Popova — a landowning widow, with dimples on her cheeks",
    "Grigory Stepanovitch Smirnov — a middle-aged landowner",
    "Luka — Popova's aged footman"
  ],
  "characters": {
    "Stage": {
      "emoji": "📜",
      "voice": null
    },
    "Popova": {
      "emoji": "🖤",
      "voice": "en-GB-LibbyNeural"
    },
    "Smirnov": {
      "emoji": "🐻",
      "voice": "en-AU-WilliamNeural"
    },
    "Luka": {
      "emoji": "🧓",
      "voice": "en-GB-OliverNeural"
    }
  },
  "lines": [
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Act I — A drawing-room in Popova's house.",
      "annotation": "Like The Proposal, the play unfolds in a single room in real time. Popova's estate is somewhere in the Russian countryside; the nearest town is at least a day's ride away."
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Popova is in deep mourning and has her eyes fixed on a photograph. Luka is haranguing her."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "It isn't right, madam. You're just destroying yourself. The maid and the cook have gone off fruit picking, every living being is rejoicing, even the cat understands how to enjoy herself and walks about in the yard, catching midges; only you sit in this room all day, as if this was a convent, and don't take any pleasure. Yes, really! I reckon it's a whole year that you haven't left the house!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I shall never go out. Why should I? My life is already at an end. He is in his grave, and I have buried myself between four walls. We are both dead."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Well, there you are! Nicolai Mihailovitch is dead, well, it's the will of God, and may his soul rest in peace. You've mourned him — and quite right. But you can't go on weeping and wearing mourning for ever.",
      "annotation": "Luka's comparison with his own dead wife is deliberately bathetic — he grieved for a month and considered that sufficient. The gap between his and Popova's understanding of grief is the engine of the opening scene."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "My old woman died too, when her time came. Well? I grieved over her, I wept for a month, and that's enough for her, but if I've got to weep for a whole age, well, the old woman isn't worth it. [Sighs] You've forgotten all your neighbours. You don't go anywhere, and you see nobody. We live, so to speak, like spiders, and never see the light. The mice have eaten my livery."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "There's a regiment quartered at Riblov, and the officers are such beauties — you can never gaze your fill at them. And every Friday there's a ball at the camp, and every day the soldier's band plays. Eh, my lady! You're young and beautiful, with roses in your cheek — if you only took a little pleasure. Beauty won't last long, you know."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[With determination] I must ask you never to talk to me about it! You know that when Nicolai Mihailovitch died, life lost all its meaning for me. I vowed never to the end of my days to cease to wear mourning, or to see the light. You hear? Let his ghost see how well I love him."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Yes, I know it's no secret to you that he was often unfair to me, cruel, and... and even unfaithful, but I shall be true till death, and show him how I can love. There, beyond the grave, he will see me as I was before his death."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Instead of talking like that you ought to go and have a walk in the garden, or else order Toby or Giant to be harnessed, and then drive out to see some of the neighbours."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Oh! [Weeps.]"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Madam! Dear madam! What is it? Bless you!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "He was so fond of Toby! He always used to ride on him to the Korchagins and Vlasovs. How well he could ride! What grace there was in his figure when he pulled at the reins with all his strength! Do you remember? Toby, Toby! Tell them to give him an extra feed of oats."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Yes, madam. [A bell rings noisily.]"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Shaking] Who's that? Tell them that I receive nobody."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Yes, madam. [Exit.]"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Looks at the photograph] You will see, Nicolas, how I can love and forgive. My love will die out with me, only when this poor heart will cease to beat. [Laughs through her tears] And aren't you ashamed? I am a good and virtuous little wife. I've locked myself in, and will be true to you till the grave, and you... aren't you ashamed, you bad child?",
      "annotation": "She's talking to the photograph — and the speech tips from grief into something like reproach. He was unfaithful; she'll show him faithfulness in death that he never deserved in life. The logic is both tender and a little absurd."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "You deceived me, had rows with me, left me alone for weeks on end."
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Luka enters in consternation."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Madam, somebody is asking for you. He wants to see you."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "But didn't you tell him that since the death of my husband I've stopped receiving?"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "I did, but he wouldn't even listen; says that it's a very pressing affair."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I do not re-ceive!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "I told him so, but the... the devil... curses and pushes himself right in. He's in the dining-room now."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Annoyed] Very well, ask him in. What manners! [Exit Luka.] How these people annoy me! What does he want of me? Why should he disturb my peace? [Sighs] No, I see that I shall have to go into a convent after all. [Thoughtfully] Yes, into a convent."
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Luka with Smirnov."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[To Luka] You fool, you're too fond of talking. Ass! [Sees Popova and speaks with respect] Madam, I have the honour to present myself. I am Grigory Stepanovitch Smirnov, landowner and retired lieutenant of artillery! I am compelled to disturb you on a very pressing affair."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Not giving him her hand] What do you want?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Your late husband, with whom I had the honour of being acquainted, died in my debt for one thousand two hundred roubles, on two bills of exchange. As I've got to pay the interest on a mortgage to-morrow, I've come to ask you, madam, to pay me the money to-day.",
      "annotation": "1,200 roubles was a substantial sum — roughly two years' wages for a skilled worker at the time. Smirnov isn't being trivial."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "One thousand two hundred. And what was my husband in debt to you for?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "He used to buy oats from me."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Sighing, to Luka] So don't you forget, Luka, to give Toby an extra feed of oats. [Exit Luka.]",
      "annotation": "She tells Luka to give the horse extra oats in the same breath as learning her husband died in debt for oats. She doesn't register it."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "If Nicolai Mihailovitch died in debt to you, then I shall certainly pay you, but you must excuse me to-day, as I haven't any spare cash. The day after to-morrow my steward will be back from town, and I'll give him instructions to settle your account, but at the moment I cannot do as you wish.",
      "annotation": "The steward managed the estate finances — a country widow without her steward was genuinely unable to raise cash quickly."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Moreover, it's exactly seven months to-day since the death of my husband, and I'm in a state of mind which absolutely prevents me from giving money matters my attention."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "And I'm in a state of mind which, if I don't pay the interest due to-morrow, will force me to make a graceful exit from this life feet first. They'll take my estate!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "You'll have your money the day after to-morrow."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I don't want the money the day after tomorrow, I want it to-day."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "You must excuse me, I can't pay you."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "And I can't wait till after to-morrow."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Well, what can I do if I haven't the money now!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "You mean to say, you can't pay me?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I can't."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Hm! Is that the last word you've got to say?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Yes, the last word."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "The last word? Absolutely your last?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Absolutely."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Thank you so much. I'll make a note of it. [Shrugs his shoulders] And then people want me to keep calm!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I meet a man on the road, and he asks me 'Why are you always so angry, Grigory Stepanovitch?' But how on earth am I not to get angry? I want the money desperately. I rode out yesterday, early in the morning, and called on all my debtors, and not a single one of them paid up!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I was just about dead-beat after it all, slept, goodness knows where, in some inn, kept by a Jew, with a vodka-barrel by my head. At last I get here, seventy versts from home, and hope to get something, and I am received by you with a 'state of mind'! How shouldn't I get angry.",
      "annotation": "Seventy versts is roughly fifty miles — a hard day's ride on poor rural roads."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I thought I distinctly said my steward will pay you when he returns from town."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I didn't come to your steward, but to you! What the devil, excuse my saying so, have I to do with your steward!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Excuse me, sir, I am not accustomed to listen to such expressions or to such a tone of voice. I want to hear no more. [Makes a rapid exit.]"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Well, there! 'A state of mind.' 'Husband died seven months ago!' Must I pay the interest, or mustn't I? I ask you: must I pay, or must I not? Suppose your husband is dead, and you've got a state of mind, and nonsense of that sort."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "And your steward's gone away somewhere, devil take him, what do you want me to do? I go to Grusdev and he isn't at home, Yaroshevitch has hidden himself, I had a violent row with Kuritsin and nearly threw him out of the window, Mazugo has something the matter with his bowels, and this woman has 'a state of mind.'",
      "annotation": "The list of debtors who've evaded him — each with a comic reason for non-payment — establishes that Smirnov has spent the whole day being frustrated before arriving here."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Not one of the swine wants to pay me! Just because I'm too gentle with them, because I'm a rag, just weak wax in their hands! I'm much too gentle with them! Well, just you wait! I shall jolly well stay here until she pays! Brr! [Yells] Waiter!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Luka."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "What is it?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Get me some kvass or water! [Exit Luka.]",
      "annotation": "Kvass — a mildly fermented drink made from bread, common in rural Russia. Non-alcoholic, though Smirnov will shortly ask for vodka instead."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "What a way to reason! A man is in desperate need of his money, and she won't pay it because, you see, she is not disposed to attend to money matters. That's real silly feminine logic. That's why I never did like, and don't like now, to have to talk to women.",
      "annotation": "Smirnov's tirade against women runs throughout the play and escalates with each repetition — until the moment it collapses entirely."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I'd rather sit on a barrel of gunpowder than talk to a woman. Brr! I feel quite chilly — and it's all on account of that little bit of fluff!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Luka with water."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Madam is ill and will see nobody."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Get out! [Exit Luka.] Ill and will see nobody! I'm going to stay and will sit here till you give me the money. You can be ill for a week, if you like, and I'll stay for a week. If you're ill for a year — I'll stay for a year. I'm going to get my own! You don't get at me with your widow's weeds and your dimpled cheeks! I know those dimples!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Shouts through the window] Simeon, take them out! We aren't going away at once! I'm staying here! Tell them in the stable to give the horses some oats!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Oh, it's bad. The heat's frightful, nobody pays up. I slept badly, and on top of everything else here's a bit of fluff in mourning with 'a state of mind.' My head's aching. Shall I have some vodka? Yes, I think I will. [Yells] Waiter!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Luka."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "What is it?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "A glass of vodka! [Exit Luka.] Ouf! [Sits and inspects himself] I must say I look well. Dust all over, boots dirty, unwashed, unkempt, straw on my waistcoat. The dear lady may well have taken me for a brigand."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Yawns] It's rather impolite to come into a drawing-room in this state, but it can't be helped. I am not here as a visitor, but as a creditor, and there's no dress specially prescribed for creditors."
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Luka with the vodka."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "You allow yourself to go very far, sir."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Angrily] What?"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "I... er... nothing... I really..."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Whom are you talking to? Shut up!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "[Aside] The devil's come to stay. Bad luck that brought him. [Exit.]"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Oh, how angry I am! So angry that I think I could grind the whole world to dust. I even feel sick. [Yells] Waiter!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Popova."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Her eyes downcast] Sir, in my solitude I have grown unaccustomed to the masculine voice, and I can't stand shouting. I must ask you not to disturb my peace."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Pay me the money, and I'll go."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I told you perfectly plainly; I haven't any money to spare; wait until the day after to-morrow."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "And I told you perfectly plainly I don't want the money the day after to-morrow, but to-day. If you don't pay me to-day, I'll have to hang myself to-morrow."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "But what can I do if I haven't got the money? You're so strange!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Then you won't pay me now? Eh?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I can't."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "In that case I stay here and shall wait until I get it. [Sits.] You're going to pay me the day after to-morrow? Very well! I'll stay here until the day after to-morrow. I'll sit here all the time. [Jumps up] I ask you: Have I got to pay the interest to-morrow, or haven't I? Or do you think I'm doing this for a joke?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Please don't shout! This isn't a stable!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I wasn't asking you about a stable, but whether I'd got my interest to pay to-morrow or not?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "You don't know how to behave before women!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "No, I do know how to behave before women!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "No, you don't! You're a rude, ill-bred man! Decent people don't talk to a woman like that!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "What a business! How do you want me to talk to you? In French, or what? [Loses his temper and lisps] Madame, je vous prie.... How happy I am that you don't pay me. Ah, pardon. I have disturbed you! Such lovely weather to-day! And how well you look in mourning! [Bows.]",
      "annotation": "Mocking the affected French manners fashionable among the Russian gentry — speaking French was a social marker of refinement."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "That's silly and rude."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Teasing her] Silly and rude! I don't know how to behave before women! Madam, in my time I've seen more women than you've seen sparrows! Three times I've fought duels on account of women. I've refused twelve women, and nine have refused me!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Yes! There was a time when I played the fool, scented myself, used honeyed words, wore jewellery, made beautiful bows. I used to love, to suffer, to sigh at the moon, to get sour, to thaw, to freeze. I used to love passionately, madly, every blessed way, devil take me; I used to chatter like a magpie about emancipation, and wasted half my wealth on tender feelings, but now — you must excuse me! You won't get round me like that now! I've had enough!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Black eyes, passionate eyes, ruby lips, dimpled cheeks, the moon, whispers, timid breathing — I wouldn't give a brass farthing for the lot, madam! Present company always excepted, all women, great or little, are insincere, crooked, backbiters, envious, liars to the marrow of their bones, vain, trivial, merciless, unreasonable — and a sparrow can give ten points to any philosopher in petticoats you like to name!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "You look at one of these poetic creatures: all muslin, an ethereal demi-goddess, you have a million transports of joy, and you look into her soul — and see a common crocodile! [He grips the back of a chair; the chair creaks and breaks.] But the most disgusting thing of all is that this crocodile imagines that its privilege and monopoly is its tender feelings.",
      "annotation": "The broken chair is a running gag — he smashes furniture at moments of peak emotion, apparently without noticing."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Why, hang me on that nail feet upwards if you like, but have you met a woman who can love anybody except a lapdog? When she's in love, can she do anything but snivel and slobber? You have the misfortune to be a woman — you know from yourself what is the nature of woman. Tell me truthfully, have you ever seen a woman who was sincere, faithful, and constant? You haven't!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Then, according to you, who is faithful and constant in love? Is it the man?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Yes, the man!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "The man! [Laughs bitterly.] Men are faithful and constant in love! What an idea! [With heat] What right have you to talk like that?",
      "annotation": "Popova's counter-argument is her own marriage. She doesn't contest Smirnov's position in the abstract — she attacks it with the specific evidence of her husband's infidelity."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Men are faithful and constant! Since we are talking about it, I'll tell you that of all the men I knew and know, the best was my late husband. I loved him passionately with all my being, as only a young and imaginative woman can love, I gave him my youth, my happiness, my life, my fortune, I breathed in him, I worshipped him as if I were a heathen, and... and what then?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "This best of men shamelessly deceived me at every step! After his death I found in his desk a whole drawerful of love-letters, and when he was alive — it's an awful thing to remember — he used to leave me alone for weeks at a time, and make love to other women and betray me before my very eyes; he wasted my money, and made fun of my feelings."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "And, in spite of all that, I loved him and was true to him. And not only that, but, now that he is dead, I am still true and constant to his memory. I have shut myself for ever within these four walls, and will wear these weeds to the very end."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Laughs contemptuously] Weeds! I don't understand what you take me for. As if I don't know why you wear that black domino and bury yourself between four walls!",
      "annotation": "A 'domino' here means a mourning dress — a full-length black garment."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "It's so mysterious, so poetic! When some junker or some tame poet goes past your windows he'll think: 'There lives the mysterious Tamara who, for the love of her husband, buried herself between four walls.' We know these games!",
      "annotation": "Tamara is the tragic heroine of Lermontov's poem 'The Demon' — a beautiful woman associated with a tower and doomed love. Smirnov is accusing Popova of performing grief for an audience."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Exploding] What? How dare you say all that to me?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "You may have buried yourself alive, but you haven't forgotten to powder your face!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "How dare you speak to me like that?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Please don't shout, I'm not your steward! You must allow me to call things by their real names. I'm not a woman, and I'm used to saying what I think straight out! Don't you shout, either!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I'm not shouting, it's you! Please leave me alone!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Pay me my money and I'll go."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I shan't give you any money!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Oh, no, you will."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I shan't give you a farthing, just to spite you. You leave me alone!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I have not the pleasure of being either your husband or your fiance, so please don't make scenes. [Sits.] I don't like it."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Choking with rage] So you sit down?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I do."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I ask you to go away!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Give me my money. [Aside] Oh, how angry I am! How angry I am!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I don't want to talk to impudent scoundrels! Get out of this! [Pause.] Aren't you going? No?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "No."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "No?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "No!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Very well then! [Rings. Enter Luka.] Luka, show this gentleman out!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "[Approaches Smirnov] Would you mind going out, sir, as you're asked to! You needn't..."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Jumps up] Shut up! Who are you talking to? I'll chop you into pieces!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "[Clutches at his heart] Little fathers! What people! [Falls into a chair.] Oh, I'm ill, I'm ill! I can't breathe!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Where's Dasha? Dasha! [Shouts.] Dasha! Pelageya! Dasha! [Rings.]"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Oh! They've all gone out to pick fruit. There's nobody at home! I'm ill! Water!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Get out of this, now."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Can't you be more polite?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Clenches her fists and stamps her foot] You're a boor! A coarse bear! A Bourbon! A monster!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "What? What did you say?",
      "annotation": "'Bear' (medved) is the insult that gives the play its title."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "I said you are a bear, a monster!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Approaching her] May I ask what right you have to insult me?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "And suppose I am insulting you? Do you think I'm afraid of you?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "And do you think that just because you're a poetic creature you can insult me with impunity? Eh? We'll fight it out!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Little fathers! What people! Water!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Pistols!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Do you think I'm afraid of you just because you have large fists and a bull's throat? Eh? You Bourbon!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "We'll fight it out! I'm not going to be insulted by anybody, and I don't care if you are a woman, one of the 'softer sex,' indeed!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Trying to interrupt him] Bear! Bear! Bear!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "It's about time we got rid of the prejudice that only men need pay for their insults. Devil take it, if you want equality of rights you can have it. We're going to fight it out!",
      "annotation": "The women's emancipation movement was a live political debate in 1880s Russia. Smirnov is invoking it sardonically — demanding she accept the responsibilities of equality, not just its privileges."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "With pistols? Very well!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "This very minute."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "This very minute! My husband had some pistols. I'll bring them here. [Is going, but turns back.] What pleasure it will give me to put a bullet into your thick head! Devil take you! [Exit.]"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I'll bring her down like a chicken! I'm not a little boy or a sentimental puppy; I don't care about this 'softer sex.'"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Gracious little fathers! [Kneels.] Have pity on a poor old man, and go away from here! You've frightened her to death, and now you want to shoot her!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Not hearing him] If she fights, well that's equality of rights, emancipation, and all that! Here the sexes are equal! I'll shoot her on principle! But what a woman! [Parodying her] 'Devil take you! I'll put a bullet into your thick head.' Eh? How she reddened, how her cheeks shone! She accepted my challenge!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "My word, it's the first time in my life that I've seen..."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Go away, sir, and I'll always pray to God for you!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "She is a woman! That's the sort I can understand! A real woman! Not a sour-faced jellybag, but fire, gunpowder, a rocket! I'm even sorry to have to kill her!"
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "[Weeps] Dear... dear sir, do go away!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I absolutely like her! Absolutely! Even though her cheeks are dimpled, I like her! I'm almost ready to let the debt go... and I'm not angry any longer. Wonderful woman!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Enter Popova with pistols."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Here are the pistols. But before we fight you must show me how to fire. I've never held a pistol in my hands before."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "Oh, Lord, have mercy and save her. I'll go and find the coachman and the gardener. Why has this infliction come on us. [Exit.]"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Examining the pistols] You see, there are several sorts of pistols. There are Mortimer pistols, specially made for duels, they fire a percussion-cap. These are Smith and Wesson revolvers, triple action, with extractors. These are excellent pistols. They can't cost less than ninety roubles the pair.",
      "annotation": "Mortimer pistols were the standard duelling weapon of the early 19th century — single-shot, smooth-bore, quite likely antiques by 1888. The Smith & Wesson revolver was a modern firearm."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Aside] Her eyes, her eyes! What an inspiring woman! [Aloud] You must hold the revolver like this. Then you cock the trigger, and take aim like this. Put your head back a little! Hold your arm out properly. Like that. Then you press this thing with your finger — and that's all. The great thing is to keep cool and aim steadily. Try not to jerk your arm."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Very well. It's inconvenient to shoot in a room, let's go into the garden."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Come along then. But I warn you, I'm going to fire in the air."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "That's the last straw! Why?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Because... because... it's my affair."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Are you afraid? Yes? Ah! No, sir, you don't get out of it! You come with me! I shan't have any peace until I've made a hole in your forehead — that forehead which I hate so much! Are you afraid?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Yes, I am afraid."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "You lie! Why won't you fight?"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Because... because I like you."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Laughs] He likes me! He dares to say that he likes me! [Points to the door] That's the way."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Loads the revolver in silence, takes his cap and goes to the door. There he stops for half a minute, while they look at each other in silence, then he hesitatingly approaches Popova.] Listen. Are you still angry? I'm devilishly annoyed, too... but, do you understand... how can I express myself?",
      "annotation": "The stage direction is one of the most detailed in the play — the half-minute of silence, the hesitation. All the bluster has run out."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "The fact is, you see, it's like this, so to speak. [Shouts] Well, is it my fault that I like you? [He snatches at the back of a chair; the chair creaks and breaks.] Devil take it, how I'm smashing up your furniture! I like you! Do you understand? I... I almost love you!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Get away from me — I hate you!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "God, what a woman! I've never in my life seen one like her! I'm lost! Done for! Fallen into a mousetrap, like a mouse!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Stand back, or I'll fire!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Fire, then! You can't understand what happiness it would be to die before those beautiful eyes, to be shot by a revolver held in that little, velvet hand. I'm out of my senses! Think, and make up your mind at once, because if I go out we shall never see each other again!",
      "annotation": "The declaration of financial eligibility as part of a love speech — income, marksmanship, horses — is comic, but not entirely absurd. It was genuinely how a man presented himself as a marriage prospect."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Decide now. I am a landowner, of respectable character, have an income of ten thousand a year. I can put a bullet through a coin tossed into the air as it comes down. I own some fine horses. Will you be my wife?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Indignantly shakes her revolver] Let's fight! Let's go out!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I'm mad. I understand nothing. [Yells] Waiter, water!"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Yells] Let's go out and fight!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I'm off my head, I'm in love like a boy, like a fool! [Snatches her hand, she screams with pain.] I love you! [Kneels.] I love you as I've never loved before! I've refused twelve women, nine have refused me, but I never loved one of them as I love you.",
      "annotation": "He gets the numbers wrong — earlier he said 'refused twelve, nine refused me.' Now he reverses them."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "I'm weak, I'm wax, I've melted. I'm on my knees like a fool, offering you my hand. Shame, shame! I haven't been in love for five years, I'd taken a vow, and now all of a sudden I'm in love, like a fish out of water! I offer you my hand. Yes or no? You don't want me? Very well! [Gets up and quickly goes to the door.]"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Stop."
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Stops] Well?"
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Nothing, go away. No, stop. No, go away, go away! I hate you! Or no.... Don't go away! Oh, if you knew how angry I am, how angry I am! [Throws her revolver on the table.] My fingers have swollen because of all this. [Tears her handkerchief in temper] What are you waiting for? Get out!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "Good-bye."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Yes, yes, go away! [Yells] Where are you going? Stop. No, go away. Oh, how angry I am! Don't come near me, don't come near me!"
    },
    {
      "type": "character",
      "sender": "Smirnov",
      "text": "[Approaching her] How angry I am with myself! I'm in love like a student, I've been on my knees. [Rudely] I love you! What do I want to fall in love with you for? To-morrow I've got to pay the interest, and begin mowing, and here you.... [Puts his arms around her] I shall never forgive myself for this."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "Get away from me! Take your hands away! I hate you! Let's go and fight!"
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "A prolonged kiss. Enter Luka with an axe, the Gardener with a rake, the Coachman with a pitchfork, and Workmen with poles."
    },
    {
      "type": "character",
      "sender": "Luka",
      "text": "[Catches sight of the pair kissing] Little fathers! [Pause.]",
      "annotation": "Luka has assembled a rescue party armed with farming tools. The pause is the whole joke."
    },
    {
      "type": "character",
      "sender": "Popova",
      "text": "[Lowering her eyes] Luka, tell them in the stables that Toby isn't to have any oats at all to-day."
    },
    {
      "type": "stage",
      "sender": "Stage",
      "text": "Curtain.",
      "annotation": "The debt is forgotten. Toby, promised extra oats twice in this play, is now punished — presumably because Popova's late husband bought those oats on credit from the man she's just kissed."
    }
  ]
}